<?
	/*1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка. */

	$i = 0;

	while ($i <= 100) {
		$i++;
		if ($i % 3 == 0) {
			echo "$i<br>";
		}
	}

	/*2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10 */

	echo "<hr>";

	function ZeroToTen() {
		$n = 0;
		do {
			if ($n == 0) {
				echo $n . " — это ноль.<br>";
			} elseif ($n % 2 == 1) {
				echo $n . " — это нечетное число.<br>";
			} elseif ($n % 2 == 0) {
				echo $n . " — это четное число.<br>";
			}
			$n++;
		} while ($n <= 10);
	}

	ZeroToTen();

	/*3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений – массивы с названиями городов из соответствующей области. */

	echo "<hr>";

	$regions = ["Алтайский край" => ["Алейск", "Барнаул", "Белокуриха", "Бийск", "Горняк"], "Архангельская область" => ["Архангельск", "Вельск", "Каргополь", "Коряжма", "Котлас"], "Брянская область" => ["Брянск", "Дятьково", "Жуковка", "Злынка", "Карачев"]];

	foreach ($regions as $region => $cities) {
		echo "<strong>$region</strong>:<br>";
		$last_key = end(array_keys($cities));
		
		foreach ($cities as $key => $city) {
			if ($key == $last_key) {
				echo $city . "<br>";
			} else {
				echo $city . ", ";
			}
		}
	}

	/*4. Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’) */

	echo "<hr>";

	function translit($string) {

		$letters = ['а' => 'a',   'б' => 'b',   'в' => 'v',
					'г' => 'g',   'д' => 'd',   'е' => 'e',
					'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
					'и' => 'i',   'й' => 'y',   'к' => 'k',
					'л' => 'l',   'м' => 'm',   'н' => 'n',
					'о' => 'o',   'п' => 'p',   'р' => 'r',
					'с' => 's',   'т' => 't',   'у' => 'u',
					'ф' => 'f',   'х' => 'h',   'ц' => 'c',
					'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
					'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
					'э' => 'e',   'ю' => 'yu',  'я' => 'ya',

					'А' => 'A',   'Б' => 'B',   'В' => 'V',
					'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
					'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
					'И' => 'I',   'Й' => 'Y',   'К' => 'K',
					'Л' => 'L',   'М' => 'M',   'Н' => 'N',
					'О' => 'O',   'П' => 'P',   'Р' => 'R',
					'С' => 'S',   'Т' => 'T',   'У' => 'U',
					'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
					'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
					'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
					'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya'];

		return strtr($string, $letters);

	}

	echo translit("Ну что? Работает?");

	/*5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку. */

	echo "<hr>";

	function removeSpace($string) {
		return strtr($string, " ", "_");
	}

	echo removeSpace("Как сам?");

	/*7. *Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла. */

	echo "<hr>";

	for ($i=-1; $i <= 8; $i++, print_r($i)) { 

	}

	/*8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К». */

	echo "<hr>";

	$regions = ["Алтайский край" => ["Алейск", "Барнаул", "Белокуриха", "Бийск", "Горняк"], "Архангельская область" => ["Архангельск", "Вельск", "Каргополь", "Коряжма", "Котлас"], "Брянская область" => ["Брянск", "Дятьково", "Жуковка", "Злынка", "Карачев"]];

	$searchLetter = "К";

	foreach ($regions as $region => $cities) {
		echo "<strong>$region</strong>:<br>";
		$last_key = end(array_keys($cities));
		
		foreach ($cities as $key => $city) {
			if (mb_substr($city, 0, 1) == $searchLetter) {
				if ($key == $last_key) {
					echo $city . "<br>";
				} else {
					echo $city . ", ";
				}
			}
		}
	}

	/*9. *Объединить две ранее написанные функции в одну, которая получает строку на русском языке, производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается при конструировании url-адресов на основе названия статьи в блогах).*/

	echo "<hr>";

	function textToUrl($string) {

		$letters = ['а' => 'a',   'б' => 'b',   'в' => 'v',
					'г' => 'g',   'д' => 'd',   'е' => 'e',
					'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
					'и' => 'i',   'й' => 'y',   'к' => 'k',
					'л' => 'l',   'м' => 'm',   'н' => 'n',
					'о' => 'o',   'п' => 'p',   'р' => 'r',
					'с' => 's',   'т' => 't',   'у' => 'u',
					'ф' => 'f',   'х' => 'h',   'ц' => 'c',
					'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
					'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
					'э' => 'e',   'ю' => 'yu',  'я' => 'ya',

					'А' => 'A',   'Б' => 'B',   'В' => 'V',
					'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
					'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
					'И' => 'I',   'Й' => 'Y',   'К' => 'K',
					'Л' => 'L',   'М' => 'M',   'Н' => 'N',
					'О' => 'O',   'П' => 'P',   'Р' => 'R',
					'С' => 'S',   'Т' => 'T',   'У' => 'U',
					'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
					'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
					'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
					'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',

					' ' => '_',   '!' => '',  	'?' => '',
					',' => '',    '—' => '-'];

		return strtr($string, $letters);

	}

	echo textToUrl("Сколько зарабатывает Тинькофф? Не ваше дело, мужчина!");

?>